Repository: FloGatt/documentation
Catalog: locale/*/LC_MESSAGES/user_guide/collaboration.po
Languages: fr

source: Profile
fr: Profil

source: :badge_user:`Logged in users`
fr: :badge_user:`Utilisateurs enregistrés`

source: Each registered user on CryptPad has a profile page accessible from the user menu:
fr: Chaque utilisateur·ice enregistré·e sur CryptPad a une page de profil. Celle-ci est accessible dans le menu utilisateur·ice :

source: User menu (avatar at the top-right) > |user-circle| **Profile**.
fr: Menu utilisateur·ice (avatar en haut à droite) > |user-circle| **Profil**.

source: Personal profile
fr: Profil personnel

source: The following elements can be customised on the profile page:
fr: Sur la page de profil personnel, les éléments suivants sont personnalisables :

source: Avatar with |upload| **Upload a new avatar**.
fr: L'avatar avec |upload| **Importer un nouvel avatar**.

source: Description with |pencil| **Add a description**.
fr: La description personnelle avec |pencil| **Ajouter une description**.

source: Website with **Add a link to your website**.
fr: L'adresse web avec **Ajouter un lien vers votre site web**.

source: Sharing:
fr: Partage :

source: **View my profile**: Preview the profile page as it appears to other users.
fr: **Voir mon profil** : Aperçu de la page de profil comme elle apparaît aux autres utilisateur·ices.

source: |share-alt| **Share**: Copy a link to your profile.
fr: |share-alt| **Partager** : Copier le lien vers votre profil.

source: User profile
fr: Profil utilisateur·ice

source: To see the profile of another user:
fr: Pour voir le profil d'un·e autre utilisateur·ice :

source: **User list** |users| |eye| of a document where they are connected > ``Click`` on their name,
fr: **Liste d'utilisateur·ices** |users| |eye| d'un document où iels sont connecté·es > `Clic` sur leur nom,

source: If the user is in your list of :ref:`contacts <contacts>`. User menu (avatar at the top-right) > |address-book| **Contacts** > ``Double click`` on their name in the list.
fr: Si l'utilisateur·ice est dans votre liste de :ref:`contacts <contacts>`. Menu utilisateur·ice (avatar en haut à droite) > |address-book| **Contacts** > ``Double clic`` sur leur nom dans la liste.

source: On another user’s profile page:
fr: Sur la page de profil d'un·e autre utilisateur·ice :

source: **Send a contact request**: Adds this user to your :ref:`contacts <contacts>` once they have approved the request.
fr: **Envoyer une demande de contact** : Ajoute cet·te utilisateur·ice à vos :ref:`contacts <contacts>` une fois votre demande acceptée.

source: |bell-slash| **Mute**: Blocks notifications and messages from this user. They will not know that they have been muted.
fr: |bell-slash| **Masquer** : Bloque les notifications et les messages venant de ce compte. L'utilisateur·ice ne sera pas informé·e que vous l'avez masqué.

source: |key| **Copy public key**: Copies the key used by instance administrators and on instances that offer subscriptions.
fr: |key| **Copier la clé publique** : Copie la clé utilisée par les administrateur·ices d'instance et/ou sur les instances avec abonnement.

source: Calendar
fr: Agenda

source: screenshot of the calendar
fr: capture d'écran du calendrier

source: To add events, simply click on the desired time/date in the calendar, view (drag for duration). Alternatively use |plus| **New event** in the toolbar.
fr: Pour ajouter un événement, cliquer sur l'heure ou la date souhaitée dans la vue du calendrier (faire glisser pour la durée). Ou utiliser |plus| **Nouvel événement** dans la barre d'outils.

source: **One time**, default option
fr: **Une fois**, option par défaut

source: **Daily**
fr: **Chaque jour**

source: **Weekly**
fr: **Chaque semaine**

source: **Monthly**
fr: **Chaque mois**

source: **Yearly**
fr: **Chaque année**

source: **Daily on weekdays**
fr: **Chaque jour ouvré de la semaine**

source: **Custom**, see below:
fr: **Personnalisé**, voir ci-dessous :

source: **Repeat every X days**, weeks, months or years
fr: **Répéter tous les X jours**, semaines, mois ou années

source: **Stop repeating**:
fr: **Se termine** :

source: Never
fr: Jamais

source: On a specific date
fr: À une date spécifique

source: After X times
fr: Après X fois

source: To edit events, drag them to the new date/time or ``Click`` to open the detailed edit view.
fr: Pour modifier un événement, le faire glisser vers la nouvelle date/heure ou cliquer sur le bouton pour ouvrir la vue détaillée.

source: Toolbar
fr: Barre d'outils

source: |plus| **New event**
fr: |plus| **Nouvel évènement**

source: **View** menu (right side): Month, Week, Day
fr: Menu **Vue** (à droite) : Mois, Semaine, Jour

source: |chevron-left| |chevron-right|: move to the previous/next period depending on the view
fr: |chevron-left| |chevron-right| : passer à la période précédente/suivante en fonction de la vue

source: **Today**: click to center the view on today
fr: **Aujourd'hui** : centrer la vue sur aujourd'hui

source: Share & Access
fr: Partage & Accès

source: CryptPad calendars work in the same way as any other documents for the purposes of :ref:`sharing <share>` and :ref:`regulating access <access>`.
fr: Les calendriers CryptPad fonctionnent de la même manière que tout autre document en ce qui concerne le :ref:`partage <share>` et la :ref:`régulation de l'accès <access>`.

source: The |ellipsis-h| menu for each calendar in the sidebar contains the following options:
fr: Le menu |ellipsis-h| de chaque calendrier contient les options suivantes :

source: |pencil| **Edit** to change the calendar name and color
fr: |pencil| **Modifier** pour changer le nom et la couleur du calendrier

source: |share-alt| **Share** and |unlock-alt| **Access** function the same way as any other CryptPad document. see :ref:`share_and_access`.
fr: |share-alt| **Partager** et |unlock-alt| **Accès** fonctionnent de la même manière que tout autre document CryptPad. Voir :ref:`share_and_access`.

source: |upload| **Import** and |download| **Export** to the standard ``.ics`` format.
fr: |upload| **Importer** et |download| **Exporter** au format standard ``.ics``.

source: |info-circle| **Properties**
fr: |info-circle| **Propriétés**

source: |trash-o| **Delete**
fr: |trash-o| **Supprimer**

source: :ref:`teams` can also have calendars available to all members. Simply share a calendar with a team to add it:
fr: Les :ref:`teams` peuvent également disposer de calendriers accessibles à tou·tes les membres. Il suffit de partager un calendrier avec une équipe pour l'ajouter :

source: |share-alt| **Share** > |address-book| **Contacts** > Select the team
fr: |share-alt| **Partager** > |address-book| **Contacts** > Sélectionner l'équipe

source: When viewing a calendar shared via link, add it to your calendars with: |calendar-plus-o| **Import this calendar**
fr: Lorsque vous consultez un calendrier partagé via un lien, ajoutez-le à vos calendriers avec : |calendar-plus-o| **Importer ce calendrier**

source: On CryptPad, using contacts makes collaboration more secure and simple.
fr: Les contacts CryptPad simplifient et sécurisent la collaboration.

source: Add a contact
fr: Ajouter un contact

source: By sharing your profile:
fr: En partageant votre profil :

source: Copy the link: User menu (avatar at the top-right) > |user-circle| **Profile** > |share-alt| **Share**.
fr: Copier le lien : menu utilisateur·ice (avatar en haut à droite) > |user-circle| **Profil** > |share-alt| **Partager**.

source: Paste and send through the means of your choice (preferably a secure mode of cummunication).
fr: Coller et envoyer par le moyen de votre choix (préférez un outil de communication sécurisé).

source: Your contact must then click **Send a contact request**.
fr: Votre contact doit ensuite cliquer sur **Envoyer une demande de contact**.

source: You get a notification with the request, click **Accept**.
fr: Vous recevez une notification avec la requête, cliquez **Accepter**.

source: On the profile page of another CryptPad user:
fr: Sur la page profil d'un·e autre utilisateur·ice :

source: Click **Send a contact request**.
fr: Cliquer sur **Envoyer une demande de contact**.

source: Manage contacts
fr: Gérer les contacts

source: To access the Contacts page:
fr: Pour accéder à la page Contacts :

source: User menu (avatar at the top-right) > |address-book| **Contacts**.
fr: menu utilisateur·ice (avatar en haut à droite) > |address-book| **Contacts**.

source: All contacts are listed at the left of the window. For each contact:
fr: La liste de contact est à gauche de la fenêtre. Pour chaque contact :

source: |bell-slash|: Mute messages and notifications.
fr: |bell-slash| : Masquer les messages et notifications.

source: |user-times|: Remove.
fr: |user-times| : Supprimer.

source: |circle|: Indicates that this contact is online.
fr: |circle| : Indique que le contact est actuellement connecté.

source: Chat with contacts
fr: Chat avec les contacts

source: On the Contacts page, ``Click`` on a contact in the list to open the chat with them in the main window.
fr: Sur la page Contacts, ``Clic`` sur un contact dans la liste ouvre la conversation avec cette personne dans la fenêtre principale.

source: Write messages in the field at the bottom and send them with |paper-plane| or ``Enter``.
fr: Écrire des messages dans le champ en bas de la fenêtre et les envoyer avec |paper-plane| ou ``Entrée``.

source: Load more chat history with |history| or delete the history with |eraser|.
fr: Récupérer l'historique du chat avec |history| ou l'effacer avec |eraser|.

source: Teams
fr: Équipes

source: CryptPad teams are shared spaces between a group of users. A team has its own CryptDrive, chat, and a list of members with roles and permissions.
fr: Les équipes CryptPad sont des espaces partagés entre plusieurs utilisateur·ices. Une équipe possède son propre stockage CryptDrive, un chat et une liste de membres dont l'accès peut être régulé.

source: The number of teams a CryptPad user can join used to be limited to 3 for performance reasons. This has now been increased to 5 as we have added details to the loading screen that show how long teams take to load. This allows users to negotiate the tradeoff between number of teams and increased loading time.
fr: Le nombre d'équipes dont un·e utilisateur·ice peut être membre était auparavant limité à 3 pour des raisons de performance. Ce nombre a été augmenté à 5 car l'écran de démarrage indique désormais le temps de chargement des équipes. Cela permet aux utilisateur·ices de négocier le compromis entre le nombre d'équipes et l'augmentation du temps de chargement.

source: To create a team:
fr: Pour créer une équipe :

source: User menu (avatar at the top-right) > |users| **Teams**.
fr: Menu utilisateur·ice (avatar en haut à droite) > |users| **Équipes**.

source: |plus-circle| **New**.
fr: |plus-circle| **Nouvelle équipe**.

source: To open an existing team:
fr: Pour ouvrir une équipe existante :

source: |list| **Teams** > **Open** button on the desired team.
fr: |list| **Équipes** > Bouton **Ouvrir** de l'équipe souhaitée.

source: Team Drive
fr: Drive d'équipe

source: The team storage space is similar to the :ref:`CryptDrive <drive>` but shared between members of the team.
fr: L'espace de stockage de l'équipe est similaire au :ref:`CryptDrive <drive>` utilisateur·ice, mais partagé entre les membres.

source: Team members
fr: Membres

source: To manage the members of a team, go to the |users| **Members** tab.
fr: L'onglet |users| **Membres** permet de gérer les membres d'une équipe.

source: Invite members
fr: Inviter des membres

source: To invite members to a team:
fr: Pour inviter des membres dans une équipe :

source: |users| **Members** tab > **Invite members**.
fr: Onglet |users| **Membres** > **Inviter des membres**.

source: |address-book| **Contacts** tab: Select CryptPad contacts to invite them to the team. Invitees receive an invite notification and can confirm they want to join the team.
fr: Onglet |address-book| **Contacts** : Sélectionner des contacts CryptPad pour les inviter. Les destinataires reçoivent une notification et peuvent accepter l'invitation.

source: |link| **Link** tab: Copy a link to send through the means of your choice (preferably a secure mode of cummunication). This link is single-use only. It becomes invalid after someone first uses it to join the team.
fr: Onglet |link| **Lien** : Copier un lien à envoyer (de préférence par un moyen sécurisé). Le lien créé est à usage unique, il est invalidé une fois qu'un·e utilisateur·ice l'utilise pour rejoindre l'équipe.

source: **Temporary name**: Used to identify the invite link in the list of pending invitations.
fr: **Nom temporaire** : Utilisé pour reconnaître l'invitation dans la liste des invitations en attente.

source: **Password**: Protect the link against potiential interception. (optional)
fr: **Mot de passe** : Protection du lien contre une éventuelle interception. (facultatif)

source: **Personal message**: Message that the recipient will see before they decide to accept the invitation to join the team.
fr: **Message personnalisé** : message visible par le destinataire avant de décider d'accepter l'invitation.

source: Roles and permissions
fr: Rôles et permissions

source: Role
fr: Rôle

source: View
fr: Lecture-seule

source: Edit
fr: Édition

source: Manage members
fr: Gérer les membres

source: Manage team
fr: Gérer l'équipe

source: Viewers
fr: Lecteur·ices

source: Members
fr: Membres

source: Admins
fr: Administrateur·ices

source: Owners
fr: Propriétaires

source: View: access folders and pads (read-only).
fr: Lecture-seule : accéder aux dossiers et documents sans les modifier.

source: Edit: create, modify, and delete folders and pads.
fr: Édition : créer, modifier et supprimer des dossiers et documents.

source: Manage Members: invite and revoke members, change member roles up to Admin.
fr: Gérer les membres : inviter et révoquer les membres, changer les rôles jusqu'à Administrateur·ice.

source: Manage Team: change team name and avatar, add or remove Owners, change team subscription, delete team.
fr: Gérer l'équipe : changer le nom et l'avatar de l'équipe, ajouter ou révoquer les propriétaires de l'équipe, supprimer l'équipe.

source: Each member’s role can be changed in the team roster. Team admins and owners can manage members of equal or lower role. For each member:
fr: La liste des membres permet de gérer le rôle de chacun. Les propriétaires et administrateur·ices de l'équipe peuvent gérer les membres de rôle égal ou inférieur. Pour chaque membre :

source: |angle-double-up| : Promote to higher role.
fr: |angle-double-up| : Promouvoir au rôle supérieur.

source: |angle-double-down|: Demote to lower role.
fr: |angle-double-down| : Rétrograder au rôle inférieur.

source: |times|: Kick from the team.
fr: |times| : Expulser de l'équipe.

source: The team chat is similar to the chat with :ref:`contacts <contacts>` except shared between all members of the team.
fr: Le chat de l'équipe est similaire au chat avec un :ref:`contacts <contacts>`, mais partagé entre tous les membres.

source: Administration tab
fr: Onglet Administration

source: :badge_owner:`Team owners`
fr: :badge_owner:`Propriétaires de l'équipe`

source: **Public signing key**: Used to identify the team on instances that offer subscitpions.
fr: **Clé publique de signature** : Utilisée pour identifier l'équipe sur les instances avec abonnements.

source: **Team name**: Change the name of the team.
fr: **Nom de l'équipe** : Changer le nom de l'équipe.

source: **Team avatar**: Import/modify an avatar for the team.
fr: **Avatar de l'équipe** : Importer/modifier un avatar pour l'équipe.

source: **Download team drive**: Save the content of all documents in the CryptDrive. When possible, this is done in a format that is readable by other software. Some applications produce files that are only readable by CryptPad.
fr: **Télécharger le drive de l'équipe** : Sauvegarde le contenu de tous les documents dans le CryptDrive de l'équipe. Quand cela est possible, des fichiers lisibles par d'autres logiciels sont téléchargés. Certaines applications produisent des fichiers qui ne sont lisibles que par CryptPad.

source: **Team deletion**: Permanently delete the team and all of its documents.
fr: **Suppression de l'équipe** : Supprime définitivement l'équipe et ses documents.
