Repository: FloGatt/documentation
Catalog: locale/*/LC_MESSAGES/user_guide/apps/code.po
Languages: ru

source: Code / Markdown
ru: Код / Markdown

source: The Code/Markdown application in CryptPad is an integration of `CodeMirror <https://codemirror.net/>`__.
ru: Приложение Код/Markdown в CryptPad представляет собой интеграцию `CodeMirror <https://codemirror.net/>`__.

source: Toolbar
ru: Инструменты

source: |wrench| **Tools**: Show/hide the text editor toolbar.
ru: |wrench| **Инструменты**: Показать/скрыть панель инструментов текстового редактора.

source: |picture-o| **Insert**: Add an image to the document. The image can be chosen in the drive or uploaded. :badge_user:`Logged in users`
ru: |picture-o| **Вставить**: добавить изображение в документ. Изображение может быть выбрано на диске или загружено. :badge_user :`Зарегистрированные пользователи`

source: |cptools palette| **Theme**: Set colors for the editor, detailed :ref:`below <app_code_theme>`.
ru: |cptools palette| **Тема**: Установите цвета для редактора, подробно :ref:`ниже <app_code_theme>`.

source: |eye| **Preview**: Show/hide the Markdown preview pane.
ru: |eye| **Предварительный просмотр**: показать/скрыть панель предварительного просмотра Markdown.

source: Theme
ru: Тема

source: |paint-brush| **Color by author**: Highlight the text written by each user with their cursor color (picked in :ref:`user settings <user_settings_cursor>`). When active:
ru: |paint-brush| **Цвета по авторам**: Выделите текст, написанный каждым пользователем, соответсвуйющим цветом курсора (выбранным в :ref:`настройках поользователя <user_settings_cursor>`). Когда активно:

source: |paint-brush| **Hide author colors** to turn off the display of colors in this window, the colors can be turned back on and remain active for other users.
ru: |paint-brush| **Скрыть цвета по авторам**, чтобы отключить отображение цветов в этом окне. Цвета можно снова включить и они останутся активными для других пользователей.

source: |paint-brush| **Color by author** > **Clear and disable** to turn off the colors for all users and delete the data.
ru: |paint-brush| **Цвета по авторам** > **Очистить и отключить**, чтобы отключить цвета для всех пользователей и удалить данные.

source: **Theme**: Color scheme used in the code editor pane.
ru: **Тема**: цветовая схема, используемая на панели редактора кода.

source: **Language**: Used for syntax highlighting.
ru: **Язык**: используется для подсветки синтаксиса.

source: Import/Export
ru: Импорт/Экспорт

source: |file-o| **File** > |upload| **Import**.
ru: |file-o| **Файл** > |upload| **Импорт**.

source: Supported formats: Any plain text file, the file extension is used to determine the language.
ru: Поддерживаемые форматы: любой обычный текстовый файл, расширение файла используется для определения языка.

source: |file-o| **File** > |download| **Export**.
ru: |file-o| **Файл** > |download| **Экспорт**.

source: Supported formats: ``.md``, any other extension can be typed for the name of the exported file.
ru: Поддерживаемые форматы: ``.md``, для имени экспортируемого файла можно указать любое другое расширение.

source: The Code application is particularly suited for writing documents in Markdown: a lightweight syntax that offers basic formatting while remaining readable. Markdown is readily converted to other formats such as HTML.
ru: Приложение Код особенно подходит для написания документов в Markdown: упрощенный синтаксис, который предлагает базовое форматирование, оставаясь при этом удобочитаемым. Markdown легко конвертируется в другие форматы, такие как HTML.

source: For examples of Markdown syntax in CryptPad please see:
ru: Примеры синтаксиса Markdown в CryptPad см. в разделе:

source: Additionally to basic Markdown syntax, the following features are also available:
ru: В дополнение к базовому синтаксису Markdown также доступны следующие функции:

source: ``[TOC]`` Inserts a table of contents.
ru: ``[TOC]`` Вставляет оглавление.

source: Todo list
ru: Список дел

source: ``- [ ] task`` for a task to do: |square-o| task.
ru: ``- [ ] task`` для задачи к выполнению: |square-o| задача.

source: ``- [x] task`` for a completed task: |check-square| task.
ru: ``- [x] задача`` для выполненной задачи: |check-square| задача.

source: As well as the following extensions:
ru: А также следующие расширения:

source: Diagrams with `Mermaid <https://mermaid-js.github.io/mermaid/#/>`__.
ru: Диаграммы с помощью`Mermaid <https://mermaid-js.github.io/mermaid/#/>`__.

source: Mindmaps with `Markmap <https://markmap.js.org/>`__.
ru: Mindmaps с помощью `Markmap <https://markmap.js.org/>`__.

source: Mathematical equations with `Mathjax <https://www.mathjax.org/>`__.
ru: Математические уравнения с помощью `Mathjax <https://www.mathjax.org/>`__.

source: To use an extension, name it as syntax for a Markdown code block, for example:
ru: Чтобы использовать расширение, назовите его как синтаксис для блока кода Markdown, например:

source: for detailed examples of the extensions in use please see:
ru: подробные примеры используемых расширений см. в разделе:

source: Images
ru: Изображения

source: Markdown syntax to include remote images such as ``![description](https://site.com/image.jpg)`` is blocked by CryptPad for security reasons.
ru: Синтаксис Markdown для включения удаленных изображений, например ``![description](https://site.com/image.jpg)``, заблокирован CryptPad по соображениям безопасности.

source: :badge_user:`Logged in users`
ru: :badge_user:`Зарегистрированные пользователи`

source: To insert images from the CryptDrive or upload new ones, use the |picture-o| **Insert** menu in the toolbar.
ru: Чтобы вставить изображения из CryptDrive или загрузить новые, используйте команду |picture-o| **Вставить** меню панели инструментов.

source: See :ref:`remote_content` for more details.
ru: См. :ref:`remote_content` для более подробной информации.

source: Lightbox
ru: Монтажный стол

source: To browse through all images and diagrams in a document using the full width of the window:
ru: Чтобы просмотреть все изображения и диаграммы в документе, используя всю ширину окна:

source: ``Double click`` on an image or diagram in the Markdown preview.
ru: ``Двойной щелчок`` на изображении или диаграмме в предварительном просмотре Markdown.

source: Navigate with the arrow keys.
ru: Перемещайтесь с помощью клавиш со стрелками.

source: Close the light box with |times| or ``Esc``.
ru: Закройте монтажный стол с помощью |times| или ``Esc``.
